% =========================================================================
% =========================================================================
% 【简要说明】：
% 例4-1：DSB-SC
%       信源(基带调制信号)m(t)：fm=1Hz，功率=1的余弦信号
%       载波c(t)：fc=10Hz
%
% 【实现功能】：
% 1.绘制DSB-SC的调制信号Sdsb(t)
% 2.绘制相干解调后的波形
% 3.绘制调制信号的功率谱密度Sdsb(W)
% 【注】：可以加入高斯白噪声
% =========================================================================
% =========================================================================
% 信源(基带调制信号)m(t)
% =========================================================================
dt = 0.001;          %时间采样间隔         
fm=1;                %信源最高频率
fc=10;               %载波中心频率
T=5;                 %信号时长
t = 0:dt:T; 
mt = sqrt(2)*cos(2*pi*fm*t);  
% =========================================================================
% DSB调制
% =========================================================================
s_dsb = mt.*cos(2*pi*fc*t);
B=2*fm; % 传输带宽=调制信号带宽的2倍
% -------------------------------------------------------------------
N0 = 0.5;            %白噪单边功率谱密度
noise = noise_nb(fc,B,N0,t);
s_dsb=s_dsb+noise;
% -------------------------------------------------------------------
figure(1)
subplot(311)
plot(t,s_dsb);hold on;     %画出DSB信号波形
plot(t,mt,'r--');          %标示mt的波形
title('DSB调制信号');
xlabel('t');
% =========================================================================
% DSB解调
% =========================================================================
rt = s_dsb.*cos(2*pi*fc*t);
rt = rt-mean(rt);
[f,rf] = T2F(t,rt);       % 傅里叶的函数
[t,rt] = lpf(f,rf,2*fm);  % 低通滤波器LPF
subplot(312)
plot(t,rt); hold on;
plot(t,mt/2,'r--');
title('相干解调后的信号波形与输入信号的比较');
xlabel('t')
subplot(313)

[f,sf]=T2F(t,s_dsb);
psf = (abs(sf).^2)/T;
plot(f,psf);
axis([-2*fc 2*fc 0 max(psf)]);
title('DSB信号功率谱');
xlabel('f');